MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX575F512L.PIC
      <edc:SFRDef edc:_addr="0x1F80F420" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-00761_pfm_control_hpmd_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn00" edc:cname="NVMADDR" edc:desc="" edc:grp="NVM" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F430" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-00761_pfm_control_hpmd_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F440" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-00761_pfm_control_hpmd_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn00" edc:cname="NVMSRCADDR" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMSRCADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMSRCADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMSRCADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80F450" edc:offset="432"/>
      <edc:SFRDef edc:_addr="0x1F80F600" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-01342_rst_integration_pb_v3.Module" edc:_refcount="1" edc:access="----------------------nnnn-nnnnn" edc:cname="RCON" edc:desc="" edc:grp="RCON" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000-00011" edc:name="RCON" edc:nzwidth="0x20" edc:por="----------------------0000-00011" edc:portals="CLR SET INV" ltx:baseofperipheral="RCON">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMR" edc:desc="" edc:mask="0x1" edc:name="CMR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F610" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-01342_rst_integration_pb_v3.Module" edc:_refcount="1" edc:access="-------------------------------n" edc:cname="RSWRST" edc:desc="" edc:grp="RCON" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="RSWRST" edc:nzwidth="0x20" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="RCON">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="" edc:mask="0x1" edc:name="SWRST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f889000" edc:endaddr="0x1f88a000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph3"/>
    <edc:SFRDataSector edc:beginaddr="0x1f88b000" edc:endaddr="0x1f88d000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph4">
      <edc:SFRDef edc:_addr="0x1F88B000" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="----snnnrrrn----n-n-r------nnnnn" edc:cname="C1CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----01001000----0-0-0------00000" edc:name="C1CON" edc:nzwidth="0x20" edc:por="----01001000----0-0-0------00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CANBUSY" edc:desc="" edc:mask="0x1" edc:name="CANBUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B010" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="---------n---nnnnnnnnnnnnnnnnnnn" edc:cname="C1CFG" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0---0000000000000000000" edc:name="C1CFG" edc:nzwidth="0x20" edc:por="---------0---0000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRP" edc:desc="" edc:mask="0x3f" edc:name="BRP" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SJW" edc:desc="" edc:mask="0x3" edc:name="SJW" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PRSEG" edc:desc="" edc:mask="0x7" edc:name="PRSEG" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SEG1PH" edc:desc="" edc:mask="0x7" edc:name="SEG1PH" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:desc="" edc:mask="0x1" edc:name="SAM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PHTS" edc:desc="" edc:mask="0x1" edc:name="SEG2PHTS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PH" edc:desc="" edc:mask="0x7" edc:name="SEG2PH" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WAKFIL" edc:desc="" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B020" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnn-------nnnnnnnnn-------nnnn" edc:cname="C1INT" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-------000000000-------0000" edc:name="C1INT" edc:nzwidth="0x20" edc:por="00000-------000000000-------0000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBIF" edc:desc="" edc:mask="0x1" edc:name="TBIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBIF" edc:desc="" edc:mask="0x1" edc:name="RBIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMRIF" edc:desc="" edc:mask="0x1" edc:name="CTMRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODIF" edc:desc="" edc:mask="0x1" edc:name="MODIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="RBOVIF" edc:desc="" edc:mask="0x1" edc:name="RBOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERRIF" edc:desc="" edc:mask="0x1" edc:name="SERRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CERRIF" edc:desc="" edc:mask="0x1" edc:name="CERRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKIF" edc:desc="" edc:mask="0x1" edc:name="WAKIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IVRIF" edc:desc="" edc:mask="0x1" edc:name="IVRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TBIE" edc:desc="" edc:mask="0x1" edc:name="TBIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:desc="" edc:mask="0x1" edc:name="RBIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMRIE" edc:desc="" edc:mask="0x1" edc:name="CTMRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODIE" edc:desc="" edc:mask="0x1" edc:name="MODIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="RBOVIE" edc:desc="" edc:mask="0x1" edc:name="RBOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERRIE" edc:desc="" edc:mask="0x1" edc:name="SERRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CERRIE" edc:desc="" edc:mask="0x1" edc:name="CERRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKIE" edc:desc="" edc:mask="0x1" edc:name="WAKIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IVRIE" edc:desc="" edc:mask="0x1" edc:name="IVRIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B030" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="-------------------rrrrr-rrrrrrr" edc:cname="C1VEC" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000001000000" edc:name="C1VEC" edc:nzwidth="0x20" edc:por="00000000000000000000000001000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICODE" edc:desc="" edc:mask="0x7f" edc:name="ICODE" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FILHIT" edc:desc="" edc:mask="0x1f" edc:name="FILHIT" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B040" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="----------rrrrrrrrrrrrrrrrrrrrrr" edc:cname="C1TREC" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1TREC" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RERRCNT" edc:desc="" edc:mask="0xff" edc:name="RERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="TERRCNT" edc:desc="" edc:mask="0xff" edc:name="TERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXWARN" edc:desc="" edc:mask="0x1" edc:name="RXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXWARN" edc:desc="" edc:mask="0x1" edc:name="TXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B050" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="C1FSTAT" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FSTAT" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOIP" edc:desc="" edc:mask="0xffffffff" edc:name="FIFOIP" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="FIFOIP0" edc:desc="" edc:mask="0x1" edc:name="FIFOIP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP1" edc:desc="" edc:mask="0x1" edc:name="FIFOIP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP2" edc:desc="" edc:mask="0x1" edc:name="FIFOIP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP3" edc:desc="" edc:mask="0x1" edc:name="FIFOIP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP4" edc:desc="" edc:mask="0x1" edc:name="FIFOIP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP5" edc:desc="" edc:mask="0x1" edc:name="FIFOIP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP6" edc:desc="" edc:mask="0x1" edc:name="FIFOIP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP7" edc:desc="" edc:mask="0x1" edc:name="FIFOIP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP8" edc:desc="" edc:mask="0x1" edc:name="FIFOIP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP9" edc:desc="" edc:mask="0x1" edc:name="FIFOIP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP10" edc:desc="" edc:mask="0x1" edc:name="FIFOIP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP11" edc:desc="" edc:mask="0x1" edc:name="FIFOIP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP12" edc:desc="" edc:mask="0x1" edc:name="FIFOIP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP13" edc:desc="" edc:mask="0x1" edc:name="FIFOIP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP14" edc:desc="" edc:mask="0x1" edc:name="FIFOIP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP15" edc:desc="" edc:mask="0x1" edc:name="FIFOIP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP16" edc:desc="" edc:mask="0x1" edc:name="FIFOIP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP17" edc:desc="" edc:mask="0x1" edc:name="FIFOIP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP18" edc:desc="" edc:mask="0x1" edc:name="FIFOIP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP19" edc:desc="" edc:mask="0x1" edc:name="FIFOIP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP20" edc:desc="" edc:mask="0x1" edc:name="FIFOIP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP21" edc:desc="" edc:mask="0x1" edc:name="FIFOIP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP22" edc:desc="" edc:mask="0x1" edc:name="FIFOIP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP23" edc:desc="" edc:mask="0x1" edc:name="FIFOIP23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP24" edc:desc="" edc:mask="0x1" edc:name="FIFOIP24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP25" edc:desc="" edc:mask="0x1" edc:name="FIFOIP25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP26" edc:desc="" edc:mask="0x1" edc:name="FIFOIP26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP27" edc:desc="" edc:mask="0x1" edc:name="FIFOIP27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP28" edc:desc="" edc:mask="0x1" edc:name="FIFOIP28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP29" edc:desc="" edc:mask="0x1" edc:name="FIFOIP29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP30" edc:desc="" edc:mask="0x1" edc:name="FIFOIP30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP31" edc:desc="" edc:mask="0x1" edc:name="FIFOIP31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
