MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX575F512L.PIC
      <edc:SFRDef edc:_addr="0x1F88B060" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="C1RXOVF" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXOVF" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXOVF" edc:desc="" edc:mask="0xffffffff" edc:name="RXOVF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="RXOVF0" edc:desc="" edc:mask="0x1" edc:name="RXOVF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF1" edc:desc="" edc:mask="0x1" edc:name="RXOVF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF2" edc:desc="" edc:mask="0x1" edc:name="RXOVF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF3" edc:desc="" edc:mask="0x1" edc:name="RXOVF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF4" edc:desc="" edc:mask="0x1" edc:name="RXOVF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF5" edc:desc="" edc:mask="0x1" edc:name="RXOVF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF6" edc:desc="" edc:mask="0x1" edc:name="RXOVF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF7" edc:desc="" edc:mask="0x1" edc:name="RXOVF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF8" edc:desc="" edc:mask="0x1" edc:name="RXOVF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF9" edc:desc="" edc:mask="0x1" edc:name="RXOVF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF10" edc:desc="" edc:mask="0x1" edc:name="RXOVF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF11" edc:desc="" edc:mask="0x1" edc:name="RXOVF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF12" edc:desc="" edc:mask="0x1" edc:name="RXOVF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF13" edc:desc="" edc:mask="0x1" edc:name="RXOVF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF14" edc:desc="" edc:mask="0x1" edc:name="RXOVF14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF15" edc:desc="" edc:mask="0x1" edc:name="RXOVF15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF16" edc:desc="" edc:mask="0x1" edc:name="RXOVF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF17" edc:desc="" edc:mask="0x1" edc:name="RXOVF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF18" edc:desc="" edc:mask="0x1" edc:name="RXOVF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF19" edc:desc="" edc:mask="0x1" edc:name="RXOVF19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF20" edc:desc="" edc:mask="0x1" edc:name="RXOVF20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF21" edc:desc="" edc:mask="0x1" edc:name="RXOVF21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF22" edc:desc="" edc:mask="0x1" edc:name="RXOVF22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF23" edc:desc="" edc:mask="0x1" edc:name="RXOVF23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF24" edc:desc="" edc:mask="0x1" edc:name="RXOVF24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF25" edc:desc="" edc:mask="0x1" edc:name="RXOVF25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF26" edc:desc="" edc:mask="0x1" edc:name="RXOVF26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF27" edc:desc="" edc:mask="0x1" edc:name="RXOVF27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF28" edc:desc="" edc:mask="0x1" edc:name="RXOVF28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF29" edc:desc="" edc:mask="0x1" edc:name="RXOVF29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF30" edc:desc="" edc:mask="0x1" edc:name="RXOVF30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF31" edc:desc="" edc:mask="0x1" edc:name="RXOVF31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B070" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1TMR" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CANTSPRE" edc:desc="" edc:mask="0xffff" edc:name="CANTSPRE" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CANTS" edc:desc="" edc:mask="0xffff" edc:name="CANTS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B080" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B090" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
